// public/data/institutes.ts
export const EVENTS = [
  {
    id: "1",
    title: "сентябрь",
    description: "входная оценка обучающихся, начало обучения на ЦК",
  },
  {
    id: "2",
    title: "до 15 октября",
    description: "завершение 1 модуля",
  },
  {
    id: "3",
    title: "до 25 декабря",
    description: "завершение 2 модуля",
  },
  {
    id: "4",
    title: "март",
    description: "промежуточная оценка обучающихся",
  },
  {
    id: "5",
    title: "до 10 марта",
    description: "завершение 3 модуля",
  },
  {
    id: "6",
    title: "до 28 апреля",
    description: "завершение 4 модуля",
  },
  {
    id: "7",
    title: "до 30 мая",
    description: "практика с представителями индустрии",
  },
  {
    id: "8",
    title: "май-июнь",
    description: "демонстрационный экзамен, итоговая оценка обучающихся",
  },
  {
    id: "9",
    title: "окончание ВУЗа",
    description: "получение диплома ЦК",
  },
];
