export const FAQ = [
  {
    question: "Какая стоимость обучения на Цифровой кафедре?",
    answer:
      "Цифровая кафедра даёт студентам шанс бесплатно освоить востребованные IT-компетенции без отрыва от основной учёбы и получить сразу 2 диплома по окончании университета",
  },
  {
    question: "Можно ли на Цифровой кафедре изучать несколько программ?",
    answer: "Нет, обучение на цифровой кафедре можно пройти только один раз",
  },
  {
    question: "Когда я получу диплом Цифровой кафедры?",
    answer:
      "Диплом Цифровой кафедры при успешном ее окончании выдается вместе с дипломом о высшем образовании",
  },
  {
    question: "Какие преимущества обучения на Цифровой кафедре?",
    answer:
      "Проект «Цифровые кафедры» объединяет следующие преимущества: обучение полностью бесплатно, не менее 60 % практики и участие в реальных проектах, партнёрство с ведущими IT‑компаниями, диплом профессиональной переподготовки по окончании, совмещение с основной образовательной программой, формирование портфолио проектов, а также доступность для студентов любых направлений обучения",
  },
];

export default FAQ