// public/data/institutes.ts
export const ITEMS = [
  {
    title: "ИМ",
    subtitle: "Высшая школа печати и медиатехнологий. Институт медиатехнологий",
    content: [
      "Алгоритмизация и программирование на языке Python",
      "Визуализация бренда в цифровой среде",
    ],
  },
  {
    title: "ИПТиО",
    subtitle:
      "Высшая школа печати и медиатехнологий. Институт полиграфических технологий и оборудования",
    content: ["Web‑дизайн", "Визуализация представления бренда"],
  },
  {
    title: "ИЗиВО",
    subtitle:
      "Высшая школа технологии и энергетики. Институт заочного и вечернего обучения",
    content: ["Алгоритмизация и программирование на языке Python"],
  },
  {
    title: "ИТ",
    subtitle: "Высшая школа технологии и энергетики. Институт технологии",
    content: ["Алгоритмизация и программирование на языке Python"],
  },
  {
    title: "ИУиЭ",
    subtitle:
      "Высшая школа технологии и энергетики Институт управления и экономики",
    content: [
      "Основы построения интеллектуальных агентов",
      "Алгоритмизация и программирование на языке Python",
    ],
  },
  {
    title: "ИЭиА",
    subtitle:
      "Высшая школа технологии и энергетики. Институт энергетики и автоматизации",
    content: ["Алгоритмизация и программирование на языке Python"],
  },
  {
    title: "ИБК",
    subtitle: "Институт бизнес-коммуникаций",
    content: [
      "Алгоритмизация и программирование на языке Python",
      "Визуализация бренда в цифровой среде",
      "Продвижение бренда на веб‑пространстве",
    ],
  },
  {
    title: "ИГД",
    subtitle: "Институт графического дизайна",
    content: ["Web‑дизайн", "Продвижение бренда на веб‑пространстве"],
  },
  {
    title: "ИДИ",
    subtitle: "Институт дизайна и искусств",
    content: ["Web‑дизайн", "Продвижение бренда на веб‑пространстве"],
  },
  {
    title: "ИДК",
    subtitle: "Институт дизайна костюма",
    content: ["Web‑дизайн", "Продвижение бренда на веб‑пространстве"],
  },
  {
    title: "ИДПС",
    subtitle: "Институт дизайна пространственной среды",
    content: ["Web‑дизайн", "Продвижение бренда на веб‑пространстве"],
  },
  {
    title: "ИИТА",
    subtitle: "Институт информационных технологий и автоматизации",
    content: [
      "Трехмерное моделирование и аддитивные технологии",
      "Визуализация представления бренда",
    ],
  },
  {
    title: "ИПИ",
    subtitle: "Институт прикладного искусства",
    content: ["Web‑дизайн"],
  },
  {
    title: "ИПХЭ",
    subtitle: "Институт прикладной химии и экологии",
    content: [
      "Web‑дизайн",
      "Алгоритмизация и программирование на языке Python",
    ],
  },
  {
    title: "ИТМ",
    subtitle: "Институт текстиля и моды",
    content: [
      "Web‑дизайн",
      "Алгоритмизация и программирование на языке Python",
      "Продвижение бренда на веб‑пространстве",
    ],
  },
  {
    title: "ИЭСТ",
    subtitle: "Институт экономики и социальных технологий",
    content: [
      "Основы построения интеллектуальных агентов",
      "Алгоритмизация и программирование на языке Python",
    ],
  },
];

export const PROGRAMS = [
  {
    title: "Web-дизайн",
    skills: [
      "Разработка макетов веб-страниц",
      "Работа с текстом, композицией и графическими элементами",
      "Оформление интерактивных прототипов многостраничного сайта",
      "Вёрстка сайта — создание программного кода",
      "Изучение методов анализа целевой аудитории и построения пути пользователя",
    ],
    institutes: [
      "ВШТЭ ИТ",
      "ВШТЭ ИЭиА",
      "ИИТА",
      "ИПИ",
      "ИПХЭ",
      "ИТМ",
      "ВШПМ ИПТиО",
    ],
    link: "",
  },
  {
    title: "Алгоритмизация и программирование на языке Python",
    skills: [
      "Современные технологии разработки программного обеспечения",
      "Основы алгоритмизации: разработка вычислительных, диалоговых и графических алгоритмов",
      "Основы программирования на языке Python",
      "Объектно-ориентированное программирование в профессиональной деятельности",
    ],
    institutes: ["ВШТЭ ИЭиА"],
    link: "",
  },
  {
    title: "Продвижение бренда на веб-пространстве",
    skills: [
      "Контент-стратегия продвижения бренда",
      "Прототипирование в веб-пространстве",
      "Основы верстки сайта",
      "Разработка интерактивного веб-контента с помощью языка JavaScript",
    ],
    institutes: [
      "ВШПМ ИМ",
      "ВШТЭ ИЭиА",
      "ИБК",
      "ИГД",
      "ИДИ",
      "ИДК",
      "ИДПС",
      "ИПИ",
      "ИТМ",
    ],
    link: "",
  },
  {
    title: "Основы построения интеллектуальных агентов",
    skills: [
      "Изучение стандартов и методик бизнес-моделирования",
      "Описание бизнес-процессов на основе анализа данных",
      "Практическое применение языков программирования, искусственного интеллекта и машинного обучения",
      "Работа в интегрированных средах разработки с инструментами отладки и проверки синтаксиса",
    ],
    institutes: [
      "ВШПМ ИПТиО",
      "ВШТЭ ИЗиВО",
      "ВШТЭ ИУиЭ",
      "ИБК",
      "ИЭСТ",
    ],
    link: "",
  },
  {
    title: "Визуализация бренда в цифровой среде",
    skills: [
      "Фундаментальные основы бренда",
      "Инструментальные средства визуализации айдентики",
      "Оформление веб-ресурса в фирменном стиле",
      "Разработка динамических элементов веб-ресурсов с использованием языка JavaScript",
    ],
    institutes: ["ВШТЭ ИУиЭ", "ИБК", "ВШПМ ИМ"],
    link: "",
  },
  {
    title: "Цифровой брендинг: визуальная стратегия",
    skills: [
      "Фундаментальные основы бренда",
      "Инструментальные средства визуализации айдентики",
      "Оформление веб-ресурса в фирменном стиле",
      "Разработка динамических элементов веб-ресурсов с использованием языка JavaScript",
    ],
    institutes: ["ВШПМ ИМ"],
    link: "",
  },
];

