// public/data/institutes.ts
export const ITEMS = [
  {
    title: 'ИМ',
    subtitle: 'Высшая школа печати и медиатехнологий. Институт медиатехнологий',
    content: [
      'Алгоритмизация и программирование на языке Python',
      'Визуализация бренда в цифровой среде',
    ],
  },
  {
    title: 'ИПТиО',
    subtitle: 'Высшая школа печати и медиатехнологий. Институт полиграфических технологий и оборудования',
    content: [
      'Web‑дизайн',
      'Визуализация представления бренда',
    ],
  },
  {
    title: 'ИЗиВО',
    subtitle: 'Высшая школа технологии и энергетики. Институт заочного и вечернего обучения',
    content: [
      'Алгоритмизация и программирование на языке Python',
    ],
  },
  {
    title: 'ИТ',
    subtitle: 'Высшая школа технологии и энергетики. Институт технологии',
    content: [
      'Алгоритмизация и программирование на языке Python',
    ],
  },
  {
    title: 'ИУиЭ',
    subtitle: 'Высшая школа технологии и энергетики Институт управления и экономики',
    content: [
      'Основы построения интеллектуальных агентов',
      'Алгоритмизация и программирование на языке Python',
    ],
  },
  {
    title: 'ИЭиА',
    subtitle: 'Высшая школа технологии и энергетики. Институт энергетики и автоматизации',
    content: [
      'Алгоритмизация и программирование на языке Python',
    ],
  },
  {
    title: 'ИБК',
    subtitle: 'Институт бизнес-коммуникаций',
    content: [
      'Алгоритмизация и программирование на языке Python',
      'Визуализация бренда в цифровой среде',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИГД',
    subtitle: 'Институт графического дизайна',
    content: [
      'Web‑дизайн',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИДИ',
    subtitle: 'Институт дизайна и искусств',
    content: [
      'Web‑дизайн',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИДК',
    subtitle: 'Институт дизайна костюма',
    content: [
      'Web‑дизайн',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИДПС',
    subtitle: 'Институт дизайна пространственной среды',
    content: [
      'Web‑дизайн',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИИТА',
    subtitle: 'Институт информационных технологий и автоматизации',
    content: [
      'Трехмерное моделирование и аддитивные технологии',
      'Визуализация представления бренда',
    ],
  },
  {
    title: 'ИПИ',
    subtitle: 'Институт прикладного искусства',
    content: [
      'Web‑дизайн',
    ],
  },
  {
    title: 'ИПХЭ',
    subtitle: 'Институт прикладной химии и экологии',
    content: [
      'Web‑дизайн',
      'Алгоритмизация и программирование на языке Python',
    ],
  },
  {
    title: 'ИТМ',
    subtitle: 'Институт текстиля и моды',
    content: [
      'Web‑дизайн',
      'Алгоритмизация и программирование на языке Python',
      'Продвижение бренда на веб‑пространстве',
    ],
  },
  {
    title: 'ИЭСТ',
    subtitle: 'Институт экономики и социальных технологий',
    content: [
      'Основы построения интеллектуальных агентов',
      'Алгоритмизация и программирование на языке Python',
    ],
  },
];
